tests/fixtures/credit_note_index.json

{
  "credit_notes": [
    {
      "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
      "sequential_id": 16,
      "number": "LAG15-CN16",
      "lago_invoice_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
      "invoice_number": "LAG15",
      "credit_status": "available",
      "refund_status": "pending",
      "reason": "other",
      "currency": "EUR",
      "total_amount_cents": 100,
      "credit_amount_cents": 100,
      "balance_amount_cents": 100,
      "refund_amount_cents": 100,
      "taxes_amount_cents": 40,
      "taxes_rate": "20.4",
      "sub_total_excluding_taxes_amount_cents": 200,
      "coupons_adjustement_amount_cents": 0,
      "created_at": "2022-10-04 16:21:00",
      "updated_at": "2022-10-04 16:21:00"
    }
  ],
  "meta": {
    "current_page": 1,
    "next_page": 2,
    "prev_page": null,
    "total_pages": 8,
    "total_count": 73
  }
}
