tests/fixtures/credit_note.json

{
  "credit_note": {
    "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
    "sequential_id": 16,
    "number": "LAG15-CN16",
    "lago_invoice_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
    "invoice_number": "LAG15",
    "credit_status": "available",
    "refund_status": "pending",
    "reason": "other",
    "total_amount_cents": 240,
    "total_amount_currency": "EUR",
    "credit_amount_cents": 100,
    "credit_amount_currency": "EUR",
    "balance_amount_cents": 100,
    "balance_amount_currency": "EUR",
    "refund_amount_cents": 100,
    "refund_amount_currency": "EUR",
    "vat_amount_cents": 40,
    "vat_amount_currency": "EUR",
    "sub_total_vat_excluded_amount_cents": 200,
    "sub_total_vat_excluded_amount_currency": "EUR",
    "created_at": "2022-10-04 16:21:00",
    "updated_at": "2022-10-04 16:21:00",
    "items": [
      {
        "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
        "fee": {
          "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
          "item": {
            "type": "charge",
            "code": "seats",
            "name": "User Seats"
          },
          "credit_amount_cents": 100,
          "credit_amount_currency": "EUR",
          "refund_amount_cents": 50,
          "refund_amount_currency": "EUR",
          "vat_amount_cents": 20,
          "vat_amount_currency": "EUR",
          "total_amount_cents": 120,
          "total_amount_currency": "EUR",
          "units": 12.6,
          "events_count": 4
        }
      }
    ]
  }
}
