tests/fixtures/credit_note_estimated.json

{
  "estimated_credit_note": {
    "lago_invoice_id": "1a901a90-1a90-1a90-1a90-1a901a901a90",
    "invoice_number": "LAG15",
    "currency": "EUR",
    "max_creditable_amount_cents": 100,
    "max_refundable_amount_cents": 100,
    "max_offsettable_amount_cents": 100,
    "taxes_amount_cents": 40,
    "taxes_rate": "20.0",
    "sub_total_excluding_taxes_amount_cents": 200,
    "coupons_adjustment_amount_cents": 0,
    "items": [
      {
        "lago_fee_id": "1a901a90-1a90-1a90-1a90-1a901a901a90",
        "amount_cents": 100
      }
    ],
    "applied_taxes": []
  }
}
